load_testing/tsung_config_simple.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <!--  Client side setup  -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>
  <!--  Server side setup  -->
  <servers>
    <server host="localhost" port="3000" type="tcp"/>
  </servers>
  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
  </load>
  <options>
    <!--  Set connection timeout to 2 seconds  -->
    <option name="global_ack_timeout" value="2000"/>
  </options>
  <sessions>
    <session name="Get event" weight="1" type="ts_http">
      <request>
        <http url="/events" method="GET"/>
      </request>
      <thinktime random="true" value="2"/>
    </session>
    <session name="Get invite" weight="1" type="ts_http">
      <request>
        <http url="/invites" method="GET" />
      </request>
      <thinktime random="true" value="2"/>
    </session>
    <session name="Get RSVPs" weight="1" type="ts_http">
      <request>
        <http url="/rsvps" method="GET" />
      </request>
    </session>
  </sessions>
</tsung>