load_testing/tsung_config_simple.xml
<tsung loglevel="notice">
  <!--  Client side setup  -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>
  <!--  Server side setup  -->
  <servers>
    <server host="localhost" port="3000" type="tcp"/>
  </servers>
  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
  </load>
  <options>
    <!--  Set connection timeout to 2 seconds  -->
    <option name="global_ack_timeout" value="2000"/>
  </options>
  <sessions>
    <session name="Create User" probability="100" type="ts_http">
      <request>
        <http url="/"/>
      </request>
      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/users/new"/>
      </request>
      <setdynvars sourcetype="eval"
                  code="fun({Pid,DynVars}) ->
				{ok,Val} = ts_dynvars:lookup(authenticity_token,DynVars),
				re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;, [global, {return,list}])
			end.">
        <var name="authenticity_token"/>
      </setdynvars>
      <thinktime random="true" value="2"/>
      <!--
      <request subst="true">
        <dyn_variable name="created_user_id" re="Location: http://.*/tweets/(.*)\r"/>
        <http url="/tweets" method="POST"
              contents="authenticity_token=%%_authenticity_token%%&tweet%5Bmessage%5D=Hello&tweet%5Bauthor%5D=blah"/>
      </request>
      <request subst="true">
        <http url="/tweets/%%_created_tweet_id%%"/>
      </request>
      -->
    </session>
  </sessions>
</tsung>