load_testing/tsung_config_simple.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <!--  Client side setup  -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>
  <!--  Server side setup  -->
  <servers>
    <server host="localhost" port="3000" type="tcp"/>
  </servers>
  <load>
    <arrivalphase phase="1" duration="1" unit="second" wait_all_sessions_end="true">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
  </load>
  <options>
    <!--  Set connection timeout to 2 seconds  -->
    <option name="global_ack_timeout" value="2000"/>
  </options>
  <sessions>

    <!-- signup : this will create a user and store the id in uid -->
    <session name="sign up, edit, logout" type="ts_http" weight="1">
        <request>
          <dyn_variable name="uid" jsonpath="$.id"  />
          <http url="/users" method="POST" version="1.1" content_type="application/x-www-form-urlencoded"
                contents="email=hi.pack@g.com&amp;password=test_password&amp;password_confirmation=test_password&amp;first_name=hi.pack&amp;last_name=hi.lastname"/>
        </request>
        <request subst="true">
          <http url="/events/" method="POST" version="1.1" content_type="application/x-www-form-urlencoded"
                contents="user_id=%%_uid%%&amp;host_name=%%_uid%%pack&amp;location_name=blah&amp;street_address=home&amp;start_time=12345&amp;end_time=45666&amp;title=bday&amp;description=25;commit=add_event for user_id: %%_uid%%"/>
        </request>
        <request>
          <http url="/events/%%_uid%%" method="GET"/>
        </request>
        <request>
          <http url="/events" method="GET"/>
        </request>
    </session>
  </sessions>
</tsung>